eclipse-threadx/getting-started/NXP/MIMXRT1060-EVK/lib/MIMXRT1060-evk/src/components/flash/nor/flexspi/fsl_flexspi_nor_flash.c
/*
 * Copyright 2019-2020 NXP
 * All rights reserved.
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include <string.h>
#include <stdlib.h>
#include <stdbool.h>
#include "fsl_nor_flash.h"
#include "fsl_flexspi_nor_flash.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define MAX_24BIT_ADDRESSING_SIZE (16UL * 1024UL * 1024UL)
#define NOR_CMD_LUT_FOR_IP_CMD    1
#define SFDP_JESD216_SIGNATURE    0x50444653U
#define SFDP_JESD216_MAJOR        1U
#define SFDP_JESD216_MINOR        0U
#define SFDP_JESD216A_MINOR       5U
#define SFDP_JESD216B_MINOR       6U
#define SFDP_JESD216C_MINOR       7U
#define SFDP_JESD216D_MINOR       8U

static flexspi_mem_nor_handle_t flexspiMemHandle;

/*! @brief Misc feature bit definitions. */
enum
{
    kFlexSpiMiscOffset_DiffClkEnable            = 0, /*!< Bit for Differential clock enable*/
    kFlexSpiMiscOffset_Ck2Enable                = 1, /*!< Bit for CK2 enable*/
    kFlexSpiMiscOffset_ParallelEnable           = 2, /*!< Bit for Parallel mode enable*/
    kFlexSpiMiscOffset_WordAddressableEnable    = 3, /*!< Bit for Word Addressable enable*/
    kFlexSpiMiscOffset_SafeConfigFreqEnable     = 4, /*!< Bit for Safe Configuration Frequency enable*/
    kFlexSpiMiscOffset_PadSettingOverrideEnable = 5, /*!< Bit for Pad setting override enable*/
    kFlexSpiMiscOffset_DdrModeEnable            = 6, /*!< Bit for DDR clock confiuration indication.*/
};

/*! @brief Flash read sample clock source. */
enum
{
    kFlexSPIReadSampleClk_LoopbackInternally      = 0,
    kFlexSPIReadSampleClk_LoopbackFromDqsPad      = 1,
    kFlexSPIReadSampleClk_LoopbackFromSckPad      = 2,
    kFlexSPIReadSampleClk_ExternalInputFromDqsPad = 3,
};

/*! @brief NOR flash command sequence instruction. */
enum
{
    kSerialNorCmd_BasicRead_3B = 0x03,
    kSerialNorCmd_BasicRead_4B =
        0x13, /* See JESD216D 6.6.3(JEDEC 4-byte Address Instruction Table: 1th DWORD) for more details. */
    kSerialNorCmd_PageProgram_1_1_1_3B = 0x02,
    kSerialNorCmd_PageProgram_1_1_1_4B =
        0x12, /* See JESD216D 6.6.3(JEDEC 4-byte Address Instruction Table: 1th DWORD) for more details. */
    kSerialNorCmd_PageProgram_1_4_4_4B =
        0x3E, /* See JESD216D 6.6.3(JEDEC 4-byte Address Instruction Table: 1th DWORD) for more details. */
    kSerialNorCmd_PageProgram_1_1_4_4B =
        0x34, /* See JESD216D 6.6.3(JEDEC 4-byte Address Instruction Table: 1th DWORD) for more details. */
    kSerialNorCmd_kFLEXSPI_Command_READ_SDR_1_4_4_3B = 0xEB,
    kSerialNorCmd_kFLEXSPI_Command_READ_DDR_1_4_4_3B = 0xED,
    kSerialNorCmd_kFLEXSPI_Command_READ_SDR_1_1_1_4B =
        0x0C, /* See JESD216D 6.6.3(JEDEC 4-byte Address Instruction Table: 1th DWORD) for more details. */
    kSerialNorCmd_kFLEXSPI_Command_READ_SDR_1_4_4_4B =
        0xEC, /* See JESD216D 6.6.3(JEDEC 4-byte Address Instruction Table: 1th DWORD) for more details. */
    kSerialNorCmd_kFLEXSPI_Command_READ_SDR_1_1_4_4B =
        0x6C, /* See JESD216D 6.6.3(JEDEC 4-byte Address Instruction Table: 1th DWORD) for more details. */
    kSerialNorCmd_kFLEXSPI_Command_READ_DDR_1_1_1_4B =
        0x0E, /* See JESD216D 6.6.3(JEDEC 4-byte Address Instruction Table: 1th DWORD) for more details. */
    kSerialNorCmd_kFLEXSPI_Command_READ_DDR_1_4_4_4B =
        0xEE, /* See JESD216D 6.6.3(JEDEC 4-byte Address Instruction Table: 1th DWORD) for more details. */
    kSerialNorCmd_ChipErase    = 0x60, /* 0x60 or 0xC7 */
    kSerialNorCmd_WriteEnable  = 0x06, /*See instruction set table in any serial flash RM. */
    kSerialNorCmd_WriteDisable = 0x04, /*See instruction set table in any serial flash RM. */
    kSerialNorCmd_WriteStatusReg1 =
        0x01, /* See JESD216D 6.4.18(JEDEC Basic Flash Parameter Table: 15th DWORD) for more details. */
    kSerialNorCmd_ReadStatusReg1 =
        0x05, /* See JESD216D 6.4.18(JEDEC Basic Flash Parameter Table: 15th DWORD) for more details. */
    kSerialNorCmd_WriteStatusReg2Bit1 =
        0x01, /* See JESD216D 6.4.18(JEDEC Basic Flash Parameter Table: 15th DWORD) for more details. */
    kSerialNorCmd_WriteStatusReg2Bit7 =
        0x3E, /* See JESD216D 6.4.18(JEDEC Basic Flash Parameter Table: 15th DWORD) for more details. */
    kSerialNorCmd_ReadStatusReg2Bit1 =
        0x35, /* See JESD216D 6.4.18(JEDEC Basic Flash Parameter Table: 15th DWORD) for more details. */
    kSerialNorCmd_ReadStatusReg2Bit7 =
        0x3F, /* See JESD216D 6.4.18(JEDEC Basic Flash Parameter Table: 15th DWORD) for more details. */
    kSerialNorCmd_ReadFlagReg = 0x70,
    kSerialNorCmd_ReadId      = 0x9F,
};

/*! @brief Octal serial NOR flash command sequence instruction. */
enum
{
    kOctalSerialNorCmd_Read_8s_8s_8s_4B_1st = 0xEC,
    kOctalSerialNorCmd_Read_8s_8s_8s_4B_2nd = 0x13,
    kOctalSerialNorCmd_Read_8d_8d_8d_4B_1st = 0xEE,
    kOctalSerialNorCmd_Read_8d_8d_8d_4B_2nd = 0x11,
    kOctalSerialNorCmd_PageProgram_4B_1st   = 0x12,
    kOctalSerialNorCmd_PageProgram_4B_2nd   = 0xED,
    kOctalSerialNorCmd_SectorErase_4B_1st   = 0x21,
    kOctalSerialNorCmd_SectorErase_4B_2nd   = 0xDE,
    kOctalSerialNorCmd_BlockErase_4B_1st    = 0xDC, /* 0xDC or 0xD8 for single mode, 0xDC for octal mode */
    kOctalSerialNorCmd_BlockErase_4B_2nd    = 0x23,
    kOctalSerialNorCmd_ChipErase_1st        = 0x60, /* 0x60 or 0xC7 */
    kOctalSerialNorCmd_ChipErase_2nd        = 0x9F, /* 0x9F or 0x38 */
    kOctalSerialNorCmd_WriteEnable_1st      = 0x06,
    kOctalSerialNorCmd_WriteEnable_2nd      = 0xF9,
    kOctalSerialNorCmd_WriteDisable_1st     = 0x04,
    kOctalSerialNorCmd_WriteDisable_2nd     = 0xFB,
    kOctalSerialNorCmd_WriteProtectSel_1st  = 0x68,
    kOctalSerialNorCmd_WriteProtectSel_2nd  = 0x97,
    kOctalSerialNorCmd_ReadStatusReg_1st    = 0x05,
    kOctalSerialNorCmd_ReadStatusReg_2nd    = 0xFA,
    kOctalSerialNorCmd_ReadConfigReg1_1st   = 0x15,
    kOctalSerialNorCmd_ReadConfigReg1_2nd   = 0xEA,
    kOctalSerialNorCmd_ReadConfigReg2_1st   = 0x71,
    kOctalSerialNorCmd_ReadConfigReg2_2nd   = 0x8E,
    kOctalSerialNorCmd_WriteStatusReg_1st   = 0x01,
    kOctalSerialNorCmd_WriteStatusReg_2nd   = 0xFE,
    kOctalSerialNorCmd_WriteConfigReg1_1st  = 0x01,
    kOctalSerialNorCmd_WriteConfigReg1_2nd  = 0xFE,
    kOctalSerialNorCmd_WriteConfigReg2_1st  = 0x72,
    kOctalSerialNorCmd_WriteConfigReg2_2nd  = 0x8D,
    kOctalSerialNorCmd_ReadSecurityReg_1st  = 0x2B,
    kOctalSerialNorCmd_ReadSecurityReg_2nd  = 0xD4,
    kOctalSerialNorCmd_WriteSecurityReg_1st = 0x2F,
    kOctalSerialNorCmd_WriteSecurityReg_2nd = 0xD0,
};

/*! @brief octal serial NOR flash OPI enable. */
enum
{
    kOctalSerialNor_SPIModeMacronix = 0x00,
    kOctalSerialNor_STRModeMacronix = 0x01,
    kOctalSerialNor_DTRModeMacronix = 0x02,

    kOctalSerialNor_SPIModeAdesto = 0x00,
    kOctalSerialNor_STRModeAdesto = 0x08,
    kOctalSerialNor_DTRModeAdesto = 0x88,
};

enum
{
    kSerialNorQpiMode_NotConfig   = 0,
    kSerialNorQpiMode_Cmd_0x38    = 1,
    kSerialNorQpiMode_Cmd_0x38_QE = 2,
    kSerialNorQpiMode_Cmd_0x35    = 3,
    kSerialNorQpiMode_Cmd_0x71    = 4,
    kSerialNorQpiMode_Cmd_0x61    = 5,
};

enum
{
    kSerialNorType_StandardSPI, /*!< Device that support Standard SPI and Extended SPI mode*/
    kSerialNorType_HyperBus,    /*!< Device that supports HyperBus only*/
    kSerialNorType_XPI,         /*!< Device that works under DPI, QPI or OPI mode*/
    kSerialNorType_NoCmd, /*!< Device that works under No command mode (XIP mode/Performance Enhance mode/continous
                             read*/
};

