eclipse-threadx/getting-started/NXP/MIMXRT1060-EVK/lib/MIMXRT1060-evk/src/components/flash/nor/flexspi/fsl_flexspi_nor_flash.c
                /* Erase Block */
                /* Adesto Block(64KB) erase instruction is 0xD8, which aligned with SFDP erase information */
                config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_ERASEBLOCK] =
                    FLEXSPI_LUT_SEQ(cmdInst, kFLEXSPI_8PAD, blockEraseCmd, addrInst, kFLEXSPI_8PAD, 0x20);

                /* Erase Chip */
                config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_CHIPERASE] =
                    FLEXSPI_LUT_SEQ(cmdInst, kFLEXSPI_8PAD, kOctalSerialNorCmd_ChipErase_1st, kFLEXSPI_Command_STOP,
                                    kFLEXSPI_8PAD, 0x00);
            }
        }

        status = kStatus_Success;
    } while (false);

    return status;
}

static status_t FLEXSPI_NOR_PrepareQuadModeEnableSequence(nor_handle_t *handle,
                                                          flexspi_mem_config_t *config,
                                                          jedec_info_table_t *tbl)
{
    assert(handle != NULL);
    assert(config != NULL);
    assert(tbl != NULL);

    status_t status = kStatus_InvalidArgument;

    /* See JESD216B/C/D 6.4.18(JEDEC Basic Flash Parameter Table: 15th DWORD) for more details. */
    do
    {
        uint32_t enter_quad_mode_option = (uint32_t)kSerialNorQuadMode_NotConfig;
        uint32_t lut_seq[4];
        FLEXSPI_NOR_Memset(lut_seq, 0, sizeof(lut_seq));

        if (tbl->basic_flash_param_tbl_size >= 64U)
        {
            config->deviceModeCfgEnable = true;

            /* Set Quad mode read instruction for LUT. */
            switch (tbl->basic_flash_param_tbl.mode_4_4_info.quad_enable_requirement)
            {
                case 1:
                case 4:
                case 5:
                    enter_quad_mode_option = (uint32_t)kSerialNorQuadMode_StatusReg2_Bit1;
                    lut_seq[0] = FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_ReadStatusReg2Bit1,
                                                 kFLEXSPI_Command_READ_SDR, kFLEXSPI_1PAD, 1);
                    break;
                case 6:
                    enter_quad_mode_option = (uint32_t)kSerialNorQuadMode_StatusReg2_Bit1_0x31;
                    lut_seq[0] = FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_ReadStatusReg2Bit1,
                                                 kFLEXSPI_Command_READ_SDR, kFLEXSPI_1PAD, 1);
                    break;
                case 2:
                    enter_quad_mode_option = (uint32_t)kSerialNorQuadMode_StatusReg1_Bit6;
                    lut_seq[0] = FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_ReadStatusReg1,
                                                 kFLEXSPI_Command_READ_SDR, kFLEXSPI_1PAD, 1);
                    break;
                case 3:
                    enter_quad_mode_option = (uint32_t)kSerialNorQuadMode_StatusReg2_Bit7;
                    lut_seq[0] = FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_ReadStatusReg2Bit7,
                                                 kFLEXSPI_Command_READ_SDR, kFLEXSPI_1PAD, 1);
                    break;
                default:
                    enter_quad_mode_option      = (uint32_t)kSerialNorQuadMode_NotConfig;
                    config->deviceModeCfgEnable = false;
                    break;
            }
        }
        else
        {
            enter_quad_mode_option = (uint32_t)config->quadMode;
        }

        if (enter_quad_mode_option != (uint32_t)kSerialNorQuadMode_NotConfig)
        {
            flexspi_transfer_t flashXfer;
            uint32_t status_val     = 0;
            flashXfer.deviceAddress = 0;
            flashXfer.port          = config->devicePort;
            flashXfer.cmdType       = kFLEXSPI_Read;
            flashXfer.data          = &status_val;
            flashXfer.dataSize      = 1;
            flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_READSTATUS;
            flashXfer.SeqNumber     = 1;

            FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_READSTATUS * 4U, lut_seq,
                              sizeof(lut_seq) / sizeof(lut_seq[0]));

            /* Read status based on new LUT for Quad mode. */
            status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);
            if (status != kStatus_Success)
            {
                break;
            }

            /* Override status value if it is required by user. */
            if (config->statusOverride != 0x00U)
            {
                status_val = config->statusOverride;
            }

            /* Do modify-afer-read status and then create Quad mode Enable sequence. */
            config->deviceModeCfgEnable = true;

            switch (enter_quad_mode_option)
            {
                case (uint32_t)kSerialNorQuadMode_StatusReg1_Bit6:
                    /* QE is set via Write Status with one data byte where bit 6 is one. */
                    config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITESTATUS * 4U] =
                        FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_WriteStatusReg1,
                                        kFLEXSPI_Command_WRITE_SDR, kFLEXSPI_1PAD, 0x01);
                    status_val |= (1UL << 0x06);
                    break;
                case (uint32_t)kSerialNorQuadMode_StatusReg2_Bit1:
                    /* QE is set via Write Status instruction 01h with two data bytes where bit 1 of the second byte is
                     * one. */
                    config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITESTATUS * 4U] =
                        FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_WriteStatusReg2Bit1,
                                        kFLEXSPI_Command_WRITE_SDR, kFLEXSPI_1PAD, 0x02);
                    status_val |= (1UL << 1);
                    status_val <<= 8;
                    break;
                case (uint32_t)kSerialNorQuadMode_StatusReg2_Bit1_0x31:
                    /* QE is set via Write Status instruction 01h with two data bytes where bit 1 of the second byte is
                     * one. */
                    config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITESTATUS * 4U] = FLEXSPI_LUT_SEQ(
                        kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, 0x31, kFLEXSPI_Command_WRITE_SDR, kFLEXSPI_1PAD, 0x01);
                    status_val |= (1UL << 1);
                    break;
                case (uint32_t)kSerialNorQuadMode_StatusReg2_Bit7:
                    /*QE is set via Write status register 2 instruction 3Eh with one data byte where bit 7 is one. */
                    config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITESTATUS * 4U] =
                        FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_WriteStatusReg2Bit7,
                                        kFLEXSPI_Command_WRITE_SDR, kFLEXSPI_1PAD, 0x01);
                    status_val |= (1UL << 0x07);
                    break;
                default:
                    config->deviceModeCfgEnable = false;
                    break;
            }

            /* Update LUT table. */
            FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_WRITESTATUS * 4UL,
                              &config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITESTATUS], 4);

            /* Enable Quad mode if status register's corresponding QE bit is 0. */
            switch (enter_quad_mode_option)
            {
                case (uint32_t)kSerialNorQuadMode_StatusReg1_Bit6:
                    if ((status_val & (1UL << 0x06)) != (1UL << 0x06))
                    {
                        (void)FLEXSPI_NOR_EnableQuadMode(handle, config);
                    };
                    break;
                case (uint32_t)kSerialNorQuadMode_StatusReg2_Bit1:
                    if ((status_val & (1UL << 0x08)) != (1UL << 0x08))
                    {
                        (void)FLEXSPI_NOR_EnableQuadMode(handle, config);
                    };
                    break;
                case (uint32_t)kSerialNorQuadMode_StatusReg2_Bit1_0x31:
                    if ((status_val & (1UL << 0x01)) != (1UL << 0x01))
                    {
                        (void)FLEXSPI_NOR_EnableQuadMode(handle, config);
                    };
                    break;
                case (uint32_t)kSerialNorQuadMode_StatusReg2_Bit7:
                    if ((status_val & (1UL << 0x07)) != (1UL << 0x07))
                    {
                        (void)FLEXSPI_NOR_EnableQuadMode(handle, config);
                    };
                    break;
                default:
                    config->deviceModeCfgEnable = false;
                    break;
            }

            config->statusOverride = (uint8_t)status_val;
        }

        status = kStatus_Success;
    } while (false);

