eclipse-threadx/getting-started/NXP/MIMXRT1060-EVK/lib/MIMXRT1060-evk/src/components/flash/nor/flexspi/fsl_flexspi_nor_flash.c
    return status;
}

static status_t FLEXSPI_NOR_EnableQuadMode(nor_handle_t *handle, flexspi_mem_config_t *config)
{
    assert(handle != NULL);
    assert(config != NULL);

    flexspi_transfer_t flashXfer;
    flexspi_mem_nor_handle_t *memHandle = (flexspi_mem_nor_handle_t *)handle->deviceSpecific;
    status_t status                     = kStatus_InvalidArgument;
    flexspi_port_t port                 = memHandle->port;
    uint32_t writeValue                 = config->statusOverride;

    /* Set write enable command instruction for LUT. */
    config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITEENABLE] = FLEXSPI_LUT_SEQ(
        kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_WriteEnable, kFLEXSPI_Command_STOP, kFLEXSPI_1PAD, 0);

    /* Update LUT table. */
    FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_WRITEENABLE * 4U,
                      &config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITEENABLE], 4);

    /* Write enable. */
    status = FLEXSPI_NOR_WriteEnable((FLEXSPI_Type *)handle->driverBaseAddr, port, 0);

    if (status == kStatus_Success)
    {
        /* Enable quad mode. */
        flashXfer.deviceAddress = 0;
        flashXfer.port          = port;
        flashXfer.cmdType       = kFLEXSPI_Write;
        flashXfer.SeqNumber     = 1;
        flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_WRITESTATUS;
        flashXfer.data          = &writeValue;
        flashXfer.dataSize      = 1;

        status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);
        if (status == kStatus_Success)
        {
            status = FLEXSPI_NOR_WaitBusBusy((FLEXSPI_Type *)handle->driverBaseAddr, memHandle, 0);
        }
    }

    return status;
}

static status_t FLEXSPI_NOR_PreEnterOctalMode(nor_handle_t *handle,
                                              flexspi_mem_config_t *config,
                                              jedec_info_table_t *tbl)
{
    assert(handle != NULL);
    assert(config != NULL);
    assert(tbl != NULL);

    status_t status                     = kStatus_Success;
    flexspi_mem_nor_handle_t *memHandle = (flexspi_mem_nor_handle_t *)handle->deviceSpecific;
    flexspi_port_t port                 = memHandle->port;
    flexspi_transfer_t flashXfer;
    uint32_t manufacturerId;

    /* ID */
    flashXfer.deviceAddress = 0;
    flashXfer.port          = port;
    flashXfer.cmdType       = kFLEXSPI_Read;
    flashXfer.SeqNumber     = 1;
    flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_READID;
    flashXfer.data          = &manufacturerId;
    flashXfer.dataSize      = 1;

    status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);

    config->manufacturerId = manufacturerId;

    /* Enter octal mode based on manufacture ID */
    switch (manufacturerId)
    {
        case kSerialNorFlash_MacronixManufacturerID:
            status = FLEXSPI_NOR_MacronixEnterOctalMode(handle, config, tbl);
            break;

        case kSerialNorFlash_Adesto32ManufacturerID:
            SUPPRESS_FALL_THROUGH_WARNING();
        case kSerialNorFlash_Adesto128ManufacturerID:
            status = FLEXSPI_NOR_AdestoEnterOctalMode(handle, config, tbl);
            break;

        default:
            assert(false);
            break;
    }

    return status;
}

static status_t FLEXSPI_NOR_ExitQuadMode(nor_handle_t *handle, flexspi_mem_config_t *config, jedec_info_table_t *tbl)
{
    assert(handle != NULL);
    assert(config != NULL);
    assert(tbl != NULL);

    status_t status = kStatus_Success;
    flexspi_transfer_t flashXfer;
    flexspi_mem_nor_handle_t *memHandle              = (flexspi_mem_nor_handle_t *)handle->deviceSpecific;
    flexspi_port_t port                              = memHandle->port;
    jedec_basic_flash_param_table_t *basicFlashTable = &tbl->basic_flash_param_tbl;

    /* Exit quad mode through issuing the soft reset command.*/
    if ((basicFlashTable->mode_4_4_info.mode_4_4_4_disable_seq & 0x0AU) == 0x0AU)
    {
        if ((basicFlashTable->mode_config_info.soft_reset_rescue_support & 0x10U) == 0x10U)
        {
            FLEXSPI_NOR_Memset(&config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4U], 0, 4 * 4);

            if (config->transferMode == kSerialNorTransferMode_SDR)
            {
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4U] = FLEXSPI_LUT_SEQ(
                    kFLEXSPI_Command_SDR, kFLEXSPI_4PAD, 0x66, kFLEXSPI_Command_SDR, kFLEXSPI_4PAD, 0x99);
            }
            else
            {
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4U] = FLEXSPI_LUT_SEQ(
                    kFLEXSPI_Command_DDR, kFLEXSPI_4PAD, 0x66, kFLEXSPI_Command_DDR, kFLEXSPI_4PAD, 0x99);
            }

            FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4U,
                              &config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITECONFIG], 4);

            flashXfer.deviceAddress = 0;
            flashXfer.port          = port;
            flashXfer.cmdType       = kFLEXSPI_Command;
            flashXfer.SeqNumber     = 1;
            flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_WRITECONFIG;

            status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);

            if (status != kStatus_Success)
            {
                return status;
            }
        }
        else
        {
            /* TBD: other methods to exit quad mode into standard SPI mode */
            status = kStatus_FLEXSPINOR_RestoreStandardSPIModeFailed;
        }
    }
    else
    {
        status = kStatus_FLEXSPINOR_RestoreStandardSPIModeFailed;
    }

    if (status == kStatus_Success)
    {
        config->CurrentCommandMode = kSerialNorCommandMode_1_1_1;
    }

    return status;
}

static status_t FLEXSPI_NOR_MacronixEnterOctalMode(nor_handle_t *handle,
                                                   flexspi_mem_config_t *config,
                                                   jedec_info_table_t *tbl)
{
    assert(handle != NULL);
    assert(config != NULL);
    assert(tbl != NULL);

