eclipse-threadx/getting-started/NXP/MIMXRT1060-EVK/lib/MIMXRT1060-evk/src/components/flash/nor/flexspi/fsl_flexspi_nor_flash.c
    status_t status          = kStatus_Success;
    uint32_t enableOctalMode = 0U;
    flexspi_transfer_t flashXfer;
    flexspi_mem_nor_handle_t *memHandle              = (flexspi_mem_nor_handle_t *)handle->deviceSpecific;
    flexspi_port_t port                              = memHandle->port;
    uint8_t writeConfigRegCmd                        = tbl->xspi_profile_1_tb1.cmd_8d_8d_8d_inst.write_volatile_reg_cmd;
    jedec_basic_flash_param_table_t *basicFlashTable = &tbl->basic_flash_param_tbl;
    uint32_t lut_seq[4];

    FLEXSPI_NOR_Memset(lut_seq, 0, sizeof(lut_seq));

    /* Enter octal mode through write configuration register 2. Details in 19th DWORD, JEDEC basic flash parameter
     * table.*/
    if ((basicFlashTable->mode_8_8_info.mode_8s_8s_8s_enable_seq & 0x04U) == 0x04U)
    {
        if (config->transferMode == kSerialNorTransferMode_SDR)
        {
            enableOctalMode = kOctalSerialNor_STRModeMacronix;

            /* Enable DQS and read strobe, and make the timing input source from DQS pad.*/
            ((FLEXSPI_Type *)handle->driverBaseAddr)->MCR0 &= ~FLEXSPI_MCR0_RXCLKSRC_MASK;
            ((FLEXSPI_Type *)handle->driverBaseAddr)->MCR0 |=
                FLEXSPI_MCR0_RXCLKSRC(kFLEXSPI_ReadSampleClkExternalInputFromDqsPad);

            /* Set the command instruction of read status register for LUT in octal sdr mode. */
            lut_seq[0] = FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_8PAD, kOctalSerialNorCmd_ReadStatusReg_1st,
                                         kFLEXSPI_Command_SDR, kFLEXSPI_8PAD, kOctalSerialNorCmd_ReadStatusReg_2nd);
            lut_seq[1] = FLEXSPI_LUT_SEQ(kFLEXSPI_Command_RADDR_SDR, kFLEXSPI_8PAD, 0x20, kFLEXSPI_Command_DUMMY_SDR,
                                         kFLEXSPI_8PAD, 0x08);
            lut_seq[2] = FLEXSPI_LUT_SEQ(kFLEXSPI_Command_READ_SDR, kFLEXSPI_8PAD, 0x04, kFLEXSPI_Command_STOP,
                                         kFLEXSPI_8PAD, 0x0);
        }
        else
        {
            enableOctalMode = kOctalSerialNor_DTRModeMacronix;

            /* Enable DQS and read strobe, and make the timing input source from DQS pad.*/
            ((FLEXSPI_Type *)handle->driverBaseAddr)->MCR0 &= ~FLEXSPI_MCR0_RXCLKSRC_MASK;
            ((FLEXSPI_Type *)handle->driverBaseAddr)->MCR0 |=
                FLEXSPI_MCR0_RXCLKSRC(kFLEXSPI_ReadSampleClkExternalInputFromDqsPad);

            /* Set the command instruction of read status register for LUT in octal ddr mode. */
            lut_seq[0] = FLEXSPI_LUT_SEQ(kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, kOctalSerialNorCmd_ReadStatusReg_1st,
                                         kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, kOctalSerialNorCmd_ReadStatusReg_2nd);
            lut_seq[1] = FLEXSPI_LUT_SEQ(kFLEXSPI_Command_RADDR_DDR, kFLEXSPI_8PAD, 0x20, kFLEXSPI_Command_READ_DDR,
                                         kFLEXSPI_8PAD, 0x04);
        }
        /* Update LUT table for status register. */
        FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_READSTATUS * 4UL, lut_seq, 4);

        FLEXSPI_NOR_Memset(&config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITECONFIG], 0, 4 * 4);
        /* Set the command instruction of write configuration register 2 for LUT in single mode. */
        config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4U] = FLEXSPI_LUT_SEQ(
            kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, writeConfigRegCmd, kFLEXSPI_Command_RADDR_SDR, kFLEXSPI_1PAD, 0x20);
        config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4U + 1U] =
            FLEXSPI_LUT_SEQ(kFLEXSPI_Command_WRITE_SDR, kFLEXSPI_1PAD, 0x04, kFLEXSPI_Command_STOP, kFLEXSPI_1PAD, 0);
        /* Update LUT table for configuration register. */
        FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4UL,
                          &config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITECONFIG], 4);

        /* Enable DQS on SDR mode */
        if (config->transferMode == kSerialNorTransferMode_SDR)
        {
            uint32_t enableDQS = 0x02U;

            /* Write enable. */
            status = FLEXSPI_NOR_WriteEnable((FLEXSPI_Type *)handle->driverBaseAddr, port, 0);

            if (status != kStatus_Success)
            {
                return status;
            }

            /* Enter octal mode. */
            flashXfer.deviceAddress = 0x200U;
            flashXfer.port          = port;
            flashXfer.cmdType       = kFLEXSPI_Write;
            flashXfer.SeqNumber     = 1;
            flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_WRITECONFIG;
            flashXfer.data          = &enableDQS;
            flashXfer.dataSize      = 1;

            status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);
            if (status != kStatus_Success)
            {
                return status;
            }
        }

        /* Write enable. */
        status = FLEXSPI_NOR_WriteEnable((FLEXSPI_Type *)handle->driverBaseAddr, port, 0);

        if (status != kStatus_Success)
        {
            return status;
        }

        /* Enter octal mode. */
        flashXfer.deviceAddress = 0;
        flashXfer.port          = port;
        flashXfer.cmdType       = kFLEXSPI_Write;
        flashXfer.SeqNumber     = 1;
        flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_WRITECONFIG;
        flashXfer.data          = &enableOctalMode;
        flashXfer.dataSize      = 1;

        status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);
        if (status != kStatus_Success)
        {
            return status;
        }

        status = FLEXSPI_NOR_WaitBusBusy((FLEXSPI_Type *)handle->driverBaseAddr, memHandle, 0);

        if (status != kStatus_Success)
        {
            return status;
        }

        if (config->transferMode == kSerialNorTransferMode_DDR)
        {
            config->CurrentCommandMode = kSerialNorCommandMode_8d_8d_8d;
        }
        else
        {
            config->CurrentCommandMode = kSerialNorCommandMode_8s_8s_8s;
        }
    }
    /* Enter octal mode through issue instruction 0x06/0xE8, details in JEDEC basic flash parameter table 19th DWORD */
    else if ((basicFlashTable->mode_8_8_info.mode_8s_8s_8s_enable_seq & 0x02U) == 0x02U)
    {
        /* Enable DQS and read strobe, and make the timing input source from DQS pad.*/
        ((FLEXSPI_Type *)handle->driverBaseAddr)->MCR0 &= ~FLEXSPI_MCR0_RXCLKSRC_MASK;
        ((FLEXSPI_Type *)handle->driverBaseAddr)->MCR0 |=
            FLEXSPI_MCR0_RXCLKSRC(kFLEXSPI_ReadSampleClkExternalInputFromDqsPad);

        /* Set the command instruction of read status register for LUT in octal sdr mode. */
        lut_seq[0] =
            FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_8PAD, 0x05, kFLEXSPI_Command_DUMMY_SDR, kFLEXSPI_8PAD, 0x04);
        lut_seq[1] =
            FLEXSPI_LUT_SEQ(kFLEXSPI_Command_READ_SDR, kFLEXSPI_8PAD, 0x04, kFLEXSPI_Command_STOP, kFLEXSPI_8PAD, 0x0);

        /* Enter octal mode */
        status = FLEXSPI_NOR_WriteEnable((FLEXSPI_Type *)handle->driverBaseAddr, port, 0);

        if (status != kStatus_Success)
        {
            return status;
        }

        status = FLEXSPI_NOR_WaitBusBusy((FLEXSPI_Type *)handle->driverBaseAddr, memHandle, 0);

        if (status != kStatus_Success)
        {
            return status;
        }

        FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_READSTATUS * 4UL, lut_seq, 4);

        FLEXSPI_NOR_Memset(&config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4U], 0, 4 * 4);
        config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4U] =
            FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, 0xE8, kFLEXSPI_Command_STOP, kFLEXSPI_1PAD, 0);
        FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4U,
                          &config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITECONFIG], 4);

