eclipse-threadx/getting-started/NXP/MIMXRT1060-EVK/lib/MIMXRT1060-evk/src/components/flash/nor/flexspi/fsl_flexspi_nor_flash.c
    return status;
}

static status_t FLEXSPI_NOR_CheckCommandModeAvailability(nor_handle_t *handle,
                                                         flexspi_mem_config_t *config,
                                                         jedec_info_table_t *tbl)
{
    assert(handle != NULL);
    assert(config != NULL);
    assert(tbl != NULL);

    status_t status                     = kStatus_Success;
    flexspi_mem_nor_handle_t *memHandle = (flexspi_mem_nor_handle_t *)handle->deviceSpecific;
    flexspi_port_t port                 = memHandle->port;
    uint8_t readValue[4]                = {0x55U, 0x55U, 0x55U, 0x55U};
    uint8_t currentCommandMode          = (uint8_t)config->CurrentCommandMode;
    uint8_t readConfigRegCmd            = tbl->xspi_profile_1_tb1.cmd_8d_8d_8d_inst.read_volatile_reg_cmd;
    uint32_t manufacturerId             = config->manufacturerId;
    flexspi_transfer_t flashXfer;

    FLEXSPI_NOR_Memset(&config->lookupTable[NOR_CMD_LUT_SEQ_IDX_READCONFIG * 4U], 0, 4U * 4U);

    if (manufacturerId == (uint32_t)kSerialNorFlash_MacronixManufacturerID)
    {
        /* Command extension to 16 bits */
        if (tbl->basic_flash_param_tbl.octal_1_8_info.octal_dtr_cmd_and_cmd_extension == 0x01U)
        {
            /* Read configuration register 2 */
            if (currentCommandMode == (uint8_t)kSerialNorCommandMode_8d_8d_8d)
            {
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_READCONFIG * 4U] = FLEXSPI_LUT_SEQ(
                    kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, readConfigRegCmd, kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x8E);
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_READCONFIG * 4U + 1U] = FLEXSPI_LUT_SEQ(
                    kFLEXSPI_Command_RADDR_DDR, kFLEXSPI_8PAD, 0x20, kFLEXSPI_Command_READ_DDR, kFLEXSPI_8PAD, 0x04);
            }
            else if (currentCommandMode == (uint8_t)kSerialNorCommandMode_8s_8s_8s)
            {
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_READCONFIG * 4U] = FLEXSPI_LUT_SEQ(
                    kFLEXSPI_Command_SDR, kFLEXSPI_8PAD, readConfigRegCmd, kFLEXSPI_Command_SDR, kFLEXSPI_8PAD, 0x8E);
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_READCONFIG * 4U + 1U] = FLEXSPI_LUT_SEQ(
                    kFLEXSPI_Command_RADDR_SDR, kFLEXSPI_8PAD, 0x20, kFLEXSPI_Command_READ_SDR, kFLEXSPI_8PAD, 0x04);
            }
            else if (currentCommandMode == (uint8_t)kSerialNorCommandMode_1_1_1)
            {
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_READCONFIG * 4U] =
                    FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, readConfigRegCmd, kFLEXSPI_Command_RADDR_SDR,
                                    kFLEXSPI_1PAD, 0x20);
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_READCONFIG * 4U + 1U] = FLEXSPI_LUT_SEQ(
                    kFLEXSPI_Command_READ_SDR, kFLEXSPI_1PAD, 0x04, kFLEXSPI_Command_STOP, kFLEXSPI_1PAD, 0);
            }
            else
            {
                ; /* TBD */
            }

            FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_READCONFIG * 4UL,
                              &config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_READCONFIG], 4);

            flashXfer.deviceAddress = 0;
            flashXfer.port          = port;
            flashXfer.cmdType       = kFLEXSPI_Read;
            flashXfer.SeqNumber     = 1;
            flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_READCONFIG;
            flashXfer.data          = (uint32_t *)(void *)&readValue[0];
            flashXfer.dataSize      = 1;

            status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);

            if (currentCommandMode == (uint8_t)kSerialNorCommandMode_8d_8d_8d)
            {
                if (readValue[0] != (uint8_t)kOctalSerialNor_DTRModeMacronix)
                {
                    status = kStatus_FLEXSPINOR_EnterOctalModeFailed;
                }
            }
            else if (currentCommandMode == (uint8_t)kSerialNorCommandMode_8s_8s_8s)
            {
                if (readValue[0] != (uint8_t)kOctalSerialNor_STRModeMacronix)
                {
                    status = kStatus_FLEXSPINOR_EnterOctalModeFailed;
                }
            }
            else if (currentCommandMode == (uint8_t)kSerialNorCommandMode_1_1_1)
            {
                if (readValue[0] != (uint8_t)kOctalSerialNor_SPIModeMacronix)
                {
                    status = kStatus_FLEXSPINOR_EnterOctalModeFailed;
                }
            }
            else
            {
                ; /* Intentional empty for MISRA C-2012 rule 15.7. */
            }
        }
        /* No command extension */
        else
        {
            ; /* TBD */
        }
    }
    else if (manufacturerId == (uint32_t)kSerialNorFlash_Adesto128ManufacturerID ||
             manufacturerId == (uint32_t)kSerialNorFlash_Adesto32ManufacturerID)
    {
        /* Command extension to 16 bits */
        if (tbl->basic_flash_param_tbl.octal_1_8_info.octal_dtr_cmd_and_cmd_extension == 0x01U)
        {
            ; /* TBD */
        }
        /* No command extension */
        else
        {
            /* Read all status and control register */
            /* For Adesto octal flash, 1 byte address is required following the command instruction.
               However, 4 bytes also applies. So, 4 bytes address may probably be set in default for other vendors.*/
            if (currentCommandMode == (uint8_t)kSerialNorCommandMode_8d_8d_8d)
            {
                /* The reason why make command instruction as CMD_SDR is that it must be in SDR mode if
                   the octal flash timing requires first command instruction. */
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_READCONFIG * 4U] =
                    FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_8PAD, readConfigRegCmd, kFLEXSPI_Command_RADDR_DDR,
                                    kFLEXSPI_8PAD, 0x20);
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_READCONFIG * 4U + 1U] = FLEXSPI_LUT_SEQ(
                    kFLEXSPI_Command_DUMMY_DDR, kFLEXSPI_8PAD, 4, kFLEXSPI_Command_READ_DDR, kFLEXSPI_8PAD, 0x04);
            }
            else if (currentCommandMode == (uint8_t)kSerialNorCommandMode_8s_8s_8s)
            {
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_READCONFIG * 4U] =
                    FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_8PAD, readConfigRegCmd, kFLEXSPI_Command_RADDR_SDR,
                                    kFLEXSPI_8PAD, 0x20);
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_READCONFIG * 4U + 1U] = FLEXSPI_LUT_SEQ(
                    kFLEXSPI_Command_DUMMY_SDR, kFLEXSPI_8PAD, 4, kFLEXSPI_Command_READ_SDR, kFLEXSPI_8PAD, 0x04);
            }
            else if (currentCommandMode == (uint8_t)kSerialNorCommandMode_1_1_1)
            {
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_READCONFIG * 4U] =
                    FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, readConfigRegCmd, kFLEXSPI_Command_RADDR_SDR,
                                    kFLEXSPI_1PAD, 0x20);
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_READCONFIG * 4U + 1U] = FLEXSPI_LUT_SEQ(
                    kFLEXSPI_Command_DUMMY_SDR, kFLEXSPI_1PAD, 8, kFLEXSPI_Command_READ_SDR, kFLEXSPI_1PAD, 0x04);
            }
            else
            {
                ; /* TBD */
            }

            FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_READCONFIG * 4UL,
                              &config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_READCONFIG], 4);

