eclipse-threadx/getting-started/NXP/MIMXRT1060-EVK/lib/MIMXRT1060-evk/src/components/flash/nor/flexspi/fsl_flexspi_nor_flash.c
            flashXfer.deviceAddress = 0;
            flashXfer.port          = port;
            flashXfer.cmdType       = kFLEXSPI_Read;
            flashXfer.SeqNumber     = 1;
            flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_READCONFIG;
            flashXfer.data          = (uint32_t *)(void *)&readValue[0];
            flashXfer.dataSize      = 4;

            status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);

            /*
             * Volatile register address map
             * ------------------------------------------
             * Address | Register name
             * ==========================================
             * 0       | Reserved - read as 0
             * -------------------------------------------
             * 1       | Status Register Byte 1
             * -------------------------------------------
             * 2       | Status Register Byte 2
             * -------------------------------------------
             * 3       | Status/Control Register Byte 3
             * -------------------------------------------
             * 4       | Status/Control Register Byte 4
             * ----------------------------------------- */
            /* Status register 2 (adesto DS)
             * bit-7: DTR(1), STR(1)
             * bit-2 and bit-3: SPI(00), QPI(01), OPI(10)
             */
            if (currentCommandMode == (uint8_t)kSerialNorCommandMode_8d_8d_8d)
            {
                if (readValue[2] != (uint8_t)kOctalSerialNor_DTRModeAdesto)
                {
                    status = kStatus_FLEXSPINOR_EnterOctalModeFailed;
                }
            }
            else if (currentCommandMode == (uint8_t)kSerialNorCommandMode_8s_8s_8s)
            {
                if (readValue[2] != (uint8_t)kOctalSerialNor_STRModeAdesto)
                {
                    status = kStatus_FLEXSPINOR_EnterOctalModeFailed;
                }
            }
            else if (currentCommandMode == (uint8_t)kSerialNorCommandMode_1_1_1)
            {
                if (readValue[2] != (uint8_t)kOctalSerialNor_SPIModeAdesto)
                {
                    status = kStatus_FLEXSPINOR_EnterOctalModeFailed;
                }
            }
            else
            {
                ; /* Intentional empty for MISRA C-2012 rule 15.7. */
            }

            /* Check software protection status, adesto octal flash should be protected in default */
            if ((readValue[1] & 0x0CU) == 0x0CU)
            {
                uint32_t globalUnprotect = 0x00U;

                FLEXSPI_NOR_Memset(&config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITEENABLE], 0, 4 * 4);
                FLEXSPI_NOR_Memset(&config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITESTATUS], 0, 4 * 4);
                if (config->transferMode == kSerialNorTransferMode_SDR)
                {
                    /* Set write enable instruction for LUT in octal sdr mode. */
                    config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITEENABLE] = FLEXSPI_LUT_SEQ(
                        kFLEXSPI_Command_SDR, kFLEXSPI_8PAD, 0x06, kFLEXSPI_Command_STOP, kFLEXSPI_8PAD, 0);

                    /* Set write stauts register 1 instruction for LUT in octal sdr mode. */
                    config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITESTATUS * 4U] = FLEXSPI_LUT_SEQ(
                        kFLEXSPI_Command_SDR, kFLEXSPI_8PAD, 0x01, kFLEXSPI_Command_WRITE_SDR, kFLEXSPI_8PAD, 0x04);
                }
                else
                {
                    /* Set write enable instruction for LUT in octal ddr mode. */
                    config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITEENABLE] = FLEXSPI_LUT_SEQ(
                        kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x06, kFLEXSPI_Command_STOP, kFLEXSPI_8PAD, 0);

                    /* Set write stauts register 1 instruction for LUT in octal ddr mode. */
                    /* The reason why make command instruction as CMD_SDR is that it must be in SDR mode if
                   the octal flash timing requires first command instruction. */
                    config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITESTATUS * 4U] = FLEXSPI_LUT_SEQ(
                        kFLEXSPI_Command_SDR, kFLEXSPI_8PAD, 0x01, kFLEXSPI_Command_WRITE_DDR, kFLEXSPI_8PAD, 0x04);
                }
                /* Update write enable LUT table */
                FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_WRITEENABLE * 4U,
                                  &config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITEENABLE], 4);
                /* Update status register 1 LUT table. */
                FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_WRITESTATUS * 4U,
                                  &config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITESTATUS], 4);

                /* Global unprotect for entire memory array */
                if ((readValue[1] & 0x80U) == 0x00U)
                {
                    /* Write enable. */
                    status = FLEXSPI_NOR_WriteEnable((FLEXSPI_Type *)handle->driverBaseAddr, port, 0);

                    if (kStatus_Success == status)
                    {
                        flashXfer.deviceAddress = 0;
                        flashXfer.port          = port;
                        flashXfer.cmdType       = kFLEXSPI_Write;
                        flashXfer.SeqNumber     = 1;
                        flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_WRITESTATUS;
                        flashXfer.data          = &globalUnprotect;
                        flashXfer.dataSize      = 1;

                        status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);
                    }
                }
                else
                {
                    /* SPRL be in 0x01 and set it into 0x00 */
                    readValue[0] = 0x00U;

                    /* Write enable. */
                    status = FLEXSPI_NOR_WriteEnable((FLEXSPI_Type *)handle->driverBaseAddr, port, 0);

                    if (kStatus_Success == status)
                    {
                        flashXfer.deviceAddress = 0;
                        flashXfer.port          = port;
                        flashXfer.cmdType       = kFLEXSPI_Write;
                        flashXfer.SeqNumber     = 1;
                        flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_WRITESTATUS;
                        flashXfer.data          = (uint32_t *)(void *)&readValue[0];
                        flashXfer.dataSize      = 1;

                        status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);

                        if (kStatus_Success == status)
                        {
                            flashXfer.deviceAddress = 0;
                            flashXfer.port          = port;
                            flashXfer.cmdType       = kFLEXSPI_Read;
                            flashXfer.SeqNumber     = 1;
                            flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_READCONFIG;
                            flashXfer.data          = (uint32_t *)(void *)&readValue[0];
                            flashXfer.dataSize      = 1;

                            status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);
                        }
                    }

                    if (kStatus_Success == status)
                    {
                        /* Global unprotect for entire memory array */
                        if ((readValue[0] & 0x80U) == 0x00U)
                        {
                            /* Write enable. */
                            status = FLEXSPI_NOR_WriteEnable((FLEXSPI_Type *)handle->driverBaseAddr, port, 0);

                            if (kStatus_Success == status)
                            {
                                flashXfer.deviceAddress = 0;
                                flashXfer.port          = port;
                                flashXfer.cmdType       = kFLEXSPI_Write;
                                flashXfer.SeqNumber     = 1;
                                flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_WRITESTATUS;
                                flashXfer.data          = (uint32_t *)&globalUnprotect;
                                flashXfer.dataSize      = 1;

                                status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);
                            }
                        }
                        else
                        {
                            status = kStatus_FLEXSPINOR_UnprotectMemoryFailed;
                        }
                    }
                }

                if (kStatus_Success == status)
                {
                    flashXfer.deviceAddress = 0;
                    flashXfer.port          = port;
                    flashXfer.cmdType       = kFLEXSPI_Read;
                    flashXfer.SeqNumber     = 1;
                    flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_READCONFIG;
                    flashXfer.data          = (uint32_t *)(void *)&readValue[0];
                    flashXfer.dataSize      = 4;

                    status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);

                    if (kStatus_Success == status)
                    {
                        if ((readValue[1] & 0x0CU) != 0x00U)
                        {
                            status = kStatus_FLEXSPINOR_UnprotectMemoryFailed;
                        }
                    }
                }
            }
            else
            {
                ; /* Intentional empty for MISRA C-2012 rule 15.7. */
            }
        }
    }
    else
    {
        ; /* Intentional empty for MISRA C-2012 rule 15.7. */
    }

