eclipse-threadx/getting-started/NXP/MIMXRT1060-EVK/lib/MIMXRT1060-evk/src/components/flash/nor/flexspi/fsl_flexspi_nor_flash.c
    return status;
}

/*
 * Probe API only supports change from octal mode into standard SPI mode currently.
 * TBD: will support from quad mode.
 */
static status_t FLEXSPI_NOR_ProbeCommandMode(nor_handle_t *handle, flexspi_mem_config_t *config)
{
    assert(handle != NULL);
    assert(config != NULL);

    status_t status = kStatus_InvalidArgument;
    uint32_t temp;
    uint32_t i;
    sfdp_header_t sfdp_header;
    jedec_info_table_t tbl;

    /*
     * Read SFDP command protocol based on JESD216C/D
     *
     * The Read SFDP command can be used with devices supporting modes of (1-1-1), (2-2-2), (4-4-4), or (4S-4D-4D),
     * but the instruction (5Ah), address (24 bits), eight wait states, and 50 MHz requirements remain the same.
     */
    const lut_seq_t k_sdfp_lut[1] = {
        /* Read SFDP LUT sequence for 1 pad instruction. */
        {{FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialFlash_ReadSFDP, kFLEXSPI_Command_RADDR_SDR,
                          kFLEXSPI_1PAD, 24),
          FLEXSPI_LUT_SEQ(kFLEXSPI_Command_DUMMY_SDR, kFLEXSPI_1PAD, 8, kFLEXSPI_Command_READ_SDR, kFLEXSPI_1PAD, 0xFF),
          0, 0}}};
    /* Zero initialization */
    FLEXSPI_NOR_Memset(&sfdp_header, 0, sizeof(sfdp_header));

    for (i = 0U; i < (uint8_t)kSerialNorCommandMode_max; i++)
    {
        FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_READ_SFDP * 4U,
                          (const uint32_t *)(const void *)&k_sdfp_lut[0], 4);

        status = FLEXSPI_NOR_ReadSFDP((FLEXSPI_Type *)handle->driverBaseAddr, 0, (uint32_t *)(void *)&sfdp_header,
                                      sizeof(sfdp_header));
        if (status != kStatus_Success)
        {
            status = kStatus_FLEXSPINOR_Unsupported_SFDP_Version;
        }

        if (sfdp_header.signature != SFDP_JESD216_SIGNATURE || sfdp_header.major_rev != SFDP_JESD216_MAJOR)
        {
            /* Exit from quad command mode into standard SPI command mode */
            if ((i == (uint8_t)kSerialNorCommandMode_4s_4s_4s) || (i == (uint8_t)kSerialNorCommandMode_4d_4d_4d))
            {
                /*
                 * There are several methods to change from quad mode into standard SPI mode(1-1-1) based on
                 * JESD216C/D spec. One method: Issue the Soft Reset 66/99 sequence, which is named as software reset
                 * and any on-going internal operations will be terminated and the device will return to its default
                 * power-on state(The device will always revert back to Standard SPI Mode after a Reset) and lose all
                 * the current volatile settings. Other methods: TBD.
                 */
                tbl.basic_flash_param_tbl.mode_4_4_info.mode_4_4_4_disable_seq       = 0x0AU;
                tbl.basic_flash_param_tbl.mode_config_info.soft_reset_rescue_support = 0x10U;

                /* From SDR mode to DDR mode. */
                config->CurrentCommandMode = kSerialNorCommandMode_4s_4s_4s;
                config->transferMode       = kSerialNorTransferMode_SDR;

                do
                {
                    /*
                     * Revert back to standard SPI mode
                     *
                     * Data corruption may happen if there is an on-going or suspended internal Erase or Program
                     * operation in progress when a software reset instruction sequence(First Method back to standard
                     * SPI mode) is accepted by device.
                     */
                    status = FLEXSPI_NOR_ExitQuadMode(handle, config, &tbl);

                    if (status != kStatus_Success)
                    {
                        /* Don't support within this version. */
                        tbl.basic_flash_param_tbl.mode_4_4_info.mode_4_4_4_disable_seq = 0x01U;
                    }

                    /* Check standard SPI mode depending on signature */
                    status = FLEXSPI_NOR_ReadSFDP((FLEXSPI_Type *)handle->driverBaseAddr, 0,
                                                  (uint32_t *)(void *)&sfdp_header, sizeof(sfdp_header));
                    if (status != kStatus_Success)
                    {
                        status = kStatus_FLEXSPINOR_Unsupported_SFDP_Version;
                    }

                    if (sfdp_header.signature != SFDP_JESD216_SIGNATURE || sfdp_header.major_rev != SFDP_JESD216_MAJOR)
                    {
                        status = kStatus_FLEXSPINOR_Unsupported_SFDP_Version;
                    }

                    /* The difference between the SDR mode and DDR mode is 1.*/
                    temp                       = (uint32_t)config->CurrentCommandMode + 0x01U;
                    config->CurrentCommandMode = (serial_nor_command_mode_t)temp;
                    temp                       = (uint32_t)config->transferMode + 0x01U;
                    config->transferMode       = (serial_nor_transfer_mode_t)temp;

                    if ((uint32_t)config->transferMode == 0x02U)
                    {
                        break;
                    }
                } while (status != kStatus_Success);
            }
            /* Exit from octal command mode into standard SPI command mode */
            else if ((i == (uint8_t)kSerialNorCommandMode_8s_8s_8s) || (i == (uint8_t)kSerialNorCommandMode_8d_8d_8d))
            {
                /*
                 * There are two methods to change from octal mode(8-8-8) into standard SPI mode(1-1-1) based on
                 * JESD216C/D spec. First method: Issue the Soft Reset 66/99 sequence, which is named as software reset
                 * and any on-going internal operations will be terminated and the device will return to its default
                 * power-on state(The device will always revert back to Standard SPI Mode after a Reset) and lose all
                 * the current volatile settings. Second method: Issue instruction 06h (WREN), then issue FFh
                 * instruction.
                 */
                tbl.basic_flash_param_tbl.mode_8_8_info.mode_8s_8s_8s_disable_seq = 0x08U;

                /* From SDR mode to DDR mode. */
                config->CurrentCommandMode = kSerialNorCommandMode_8s_8s_8s;
                config->transferMode       = kSerialNorTransferMode_SDR;

                do
                {
                    /*
                     * Revert back to standard SPI mode
                     *
                     * Data corruption may happen if there is an on-going or suspended internal Erase or Program
                     * operation in progress when a software reset instruction sequence(First Method back to standard
                     * SPI mode) is accepted by device.
                     */
                    /* TBD: It is recommended to check the RDY/BSY bit in Status Register Byte 1 and the PS and ES bits
                       in Status Register Byte 2 before issuing the Reset instruction sequence. */
                    status = FLEXSPI_NOR_MacronixExitOctalMode(handle, config, &tbl);

                    if (status != kStatus_Success)
                    {
                        tbl.basic_flash_param_tbl.mode_8_8_info.mode_8s_8s_8s_disable_seq = 0x01U;
                    }

