eclipse-threadx/getting-started/NXP/MIMXRT1060-EVK/lib/MIMXRT1060-evk/src/components/flash/nor/flexspi/fsl_flexspi_nor_flash.c
                    /* Check standard SPI mode depending on signature */
                    status = FLEXSPI_NOR_ReadSFDP((FLEXSPI_Type *)handle->driverBaseAddr, 0,
                                                  (uint32_t *)(void *)&sfdp_header, sizeof(sfdp_header));
                    if (status != kStatus_Success)
                    {
                        status = kStatus_FLEXSPINOR_Unsupported_SFDP_Version;
                    }

                    if (sfdp_header.signature != SFDP_JESD216_SIGNATURE || sfdp_header.major_rev != SFDP_JESD216_MAJOR)
                    {
                        status = kStatus_FLEXSPINOR_Unsupported_SFDP_Version;
                    }

                    /* The difference between the SDR mode and DDR mode is 1.*/
                    temp                       = (uint32_t)config->CurrentCommandMode + 0x01U;
                    config->CurrentCommandMode = (serial_nor_command_mode_t)temp;
                    temp                       = (uint32_t)config->transferMode + 0x01U;
                    config->transferMode       = (serial_nor_transfer_mode_t)temp;

                    if ((uint32_t)config->transferMode == 0x02U)
                    {
                        break;
                    }
                } while (status != kStatus_Success);
            }
            else
            {
                ; /* Intentional empty for MISRA C-2012 rule 15.7. */
            }
        }
        else
        {
            config->CurrentCommandMode = kSerialNorCommandMode_1_1_1;
            status                     = kStatus_Success;
            break;
        }
    }

    return status;
}

static status_t FLEXSPI_NOR_GenerateConfigBlockUsingSFDP(nor_handle_t *handle, flexspi_mem_config_t *config)
{
    assert(handle != NULL);
    assert(config != NULL);

    status_t status = kStatus_InvalidArgument;

    /*
     * Read SFDP command protocol based on JESD216C/D
     *
     * The Read SFDP command can be used with device supported modes of (1-1-1), (2-2-2), (4-4-4), or (4S-4D-4D),
     * but the instruction (5Ah), address (24 bits), eight wait states, and 50 MHz requirements remain the same.
     */
    const lut_seq_t k_sdfp_lut[4] = {
        /* Read SFDP LUT sequence in 1-1-1 mode. */
        {{FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialFlash_ReadSFDP, kFLEXSPI_Command_RADDR_SDR,
                          kFLEXSPI_1PAD, 24),
          FLEXSPI_LUT_SEQ(kFLEXSPI_Command_DUMMY_SDR, kFLEXSPI_1PAD, 8, kFLEXSPI_Command_READ_SDR, kFLEXSPI_1PAD, 0xFF),
          0, 0}},
        /* Read SFDP LUT sequence in 2-2-2 mode. */
        {{FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_2PAD, kSerialFlash_ReadSFDP, kFLEXSPI_Command_RADDR_SDR,
                          kFLEXSPI_2PAD, 24),
          FLEXSPI_LUT_SEQ(kFLEXSPI_Command_DUMMY_SDR, kFLEXSPI_2PAD, 8, kFLEXSPI_Command_READ_SDR, kFLEXSPI_2PAD, 0xFF),
          0, 0}},
        /* Read SFDP LUT sequence in 4s-4s-4s mode. */
        {{FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_4PAD, kSerialFlash_ReadSFDP, kFLEXSPI_Command_RADDR_SDR,
                          kFLEXSPI_4PAD, 24),
          FLEXSPI_LUT_SEQ(kFLEXSPI_Command_DUMMY_SDR, kFLEXSPI_4PAD, 8, kFLEXSPI_Command_READ_SDR, kFLEXSPI_4PAD, 0xFF),
          0, 0}},
        /* Reserved */
        {{0, 0, 0, 0}}};

    do
    {
        /* Probe current command mode and retore standard SPI protocol(1-1-1 mode) */
        status = FLEXSPI_NOR_ProbeCommandMode(handle, config);
        if (status != kStatus_Success)
        {
            break;
        }

        /* This will typically be used when the host controller and slave memory device are communicating in single
           SPI mode after being powered on, and the host controller will read SFDP in this mode. */
        if (config->queryPads != kFLEXSPI_1PAD)
        {
            break;
        }

        if (config->enhanceMode == kSerialNorEnhanceMode_0_4_4_Mode)
        {
            /* Try to exit 0-4-4 mode. */
            config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_EXIT_NOCMD] =
                FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_4PAD, 0xFF, kFLEXSPI_Command_SDR, kFLEXSPI_4PAD, 0xFF);
            config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_EXIT_NOCMD + 1U] =
                FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_4PAD, 0xFF, kFLEXSPI_Command_SDR, kFLEXSPI_4PAD, 0xFF);
            config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_EXIT_NOCMD + 2U] =
                FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_4PAD, 0xFF, kFLEXSPI_Command_STOP, kFLEXSPI_1PAD, 0);

            status = FLEXSPI_NOR_ExitNoCMDMode(handle, config, 0);
            if (status != kStatus_Success)
            {
                break;
            }
        }

        /* Read SFDP, probe whether the Flash device is present or not. */
        jedec_info_table_t jedec_info_tbl;

        FLEXSPI_NOR_Memset(&jedec_info_tbl, 0x00, sizeof(jedec_info_tbl));
        FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_READ_SFDP * 4U,
                          (const uint32_t *)(const void *)&k_sdfp_lut[config->queryPads], 4);

        status = FLEXSPI_NOR_ReadSFDPInfo((FLEXSPI_Type *)handle->driverBaseAddr, &jedec_info_tbl);
        if (status != kStatus_Success)
        {
            break;
        }

        status = FLEXSPI_NOR_ParseSFDP(handle, config, &jedec_info_tbl);

    } while (false);

    return status;
}

status_t Nor_Flash_Erase_Chip(nor_handle_t *handle)
{
    assert(handle != NULL);

    status_t status                     = kStatus_InvalidArgument;
    flexspi_mem_nor_handle_t *memHandle = (flexspi_mem_nor_handle_t *)handle->deviceSpecific;
    flexspi_port_t port                 = memHandle->port;
    flexspi_transfer_t flashXfer;

    /* Write enable */
    status = FLEXSPI_NOR_WriteEnable((FLEXSPI_Type *)handle->driverBaseAddr, port, 0);

    if (kStatus_Success == status)
    {
        /* Send erase chip command. */
        flashXfer.deviceAddress = 0;
        flashXfer.port          = port;
        flashXfer.cmdType       = kFLEXSPI_Command;
        flashXfer.SeqNumber     = 1;
        flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_CHIPERASE;

        status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);

        if (kStatus_Success == status)
        {
            status = FLEXSPI_NOR_WaitBusBusy((FLEXSPI_Type *)handle->driverBaseAddr, memHandle, 0);
        }
    }

    /* Do software reset. */
    FLEXSPI_SoftwareReset((FLEXSPI_Type *)handle->driverBaseAddr);

